In [1]:
#PANDAS
#SERİLER VE DATAFRAMELER ÜZERİNE KURULMUŞ PYTHON MODÜLÜ

In [5]:
import numpy as np
import pandas as pd

In [3]:
labels_list = ["Mustafa","Kemal","Murat","Kadir","Zeynep"]

In [4]:
data_list = [10,20,30,40,50]

In [5]:
pd.Series(data = data_list,index = labels_list)
#pd.Series(data_list,labels_list)

Mustafa    10
Kemal      20
Murat      30
Kadir      40
Zeynep     50
dtype: int64

In [6]:
pd.Series(data_list,labels_list)

Mustafa    10
Kemal      20
Murat      30
Kadir      40
Zeynep     50
dtype: int64

In [7]:
pd.Series(data_list)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [8]:
npArray = np.array([10,20,30,40,50])

In [10]:
pd.Series(npArray,labels_list) #data_list kullanılmadan değer atandı!

Mustafa    10
Kemal      20
Murat      30
Kadir      40
Zeynep     50
dtype: int32

In [11]:
pd.Series(data = npArray,index = ["A","B","C","D","E"])

A    10
B    20
C    30
D    40
E    50
dtype: int32

In [12]:
dataDict = {"Kadir":30,"Kemal":80,"Burak":21}

In [13]:
pd.Series(dataDict)

Kadir    30
Kemal    80
Burak    21
dtype: int64

In [14]:
ser2017 = pd.Series([5,10,14,20],["Buğday","Mısır","Kiraz","Erik"])

In [15]:
ser2017

Buğday     5
Mısır     10
Kiraz     14
Erik      20
dtype: int64

In [16]:
ser2018 = pd.Series([2,12,12,6],["Buğday","Mısır","Çilek","Erik"])

In [17]:
ser2018

Buğday     2
Mısır     12
Çilek     12
Erik       6
dtype: int64

In [18]:
ser2017 + ser2018

Buğday     7.0
Erik      26.0
Kiraz      NaN
Mısır     22.0
Çilek      NaN
dtype: float64

In [19]:
total = ser2017 + ser2018

In [20]:
total

Buğday     7.0
Erik      26.0
Kiraz      NaN
Mısır     22.0
Çilek      NaN
dtype: float64

In [21]:
total["Erik"]

26.0

In [22]:
total["Çilek"]

nan

In [23]:
label_list = ["Burak","Şimşek","Ateş","Kadir","Hasan"]

In [24]:
data_list = [21,20,20,19,18]

In [26]:
pd.Series(data=data_list,index = label_list)

Burak     21
Şimşek    20
Ateş      20
Kadir     19
Hasan     18
dtype: int64

In [28]:
pd.Series([21,20,20,19,18],label_list)

Burak     21
Şimşek    20
Ateş      20
Kadir     19
Hasan     18
dtype: int64

In [29]:
pd.Series(label_list,[21,20,20,19,18])

21     Burak
20    Şimşek
20      Ateş
19     Kadir
18     Hasan
dtype: object

In [30]:
#******************************************************************
#DATAFRAME TABIMLANMALARI!!!!!!!!!!!!!

In [8]:
from numpy.random import randn

In [33]:
randn(3,3)

array([[-1.44313571,  0.77886142,  1.36600083],
       [ 0.0790017 , -3.67061172,  2.40535034],
       [-1.21706064, -0.83806316, -0.09167412]])

In [35]:
df = pd.DataFrame(data = randn(3,3),index = ["A","B","C"],columns = ["Column 1","Columb 2","Column 3"])

In [36]:
df

   Column 1  Columb 2  Column 3
A -1.124909  0.742529 -0.608539
B  0.985538  0.627922 -1.564442
C  0.792157  1.338160 -0.912868

In [39]:
df["Column 1"]

A   -1.124909
B    0.985538
C    0.792157
Name: Column 1, dtype: float64

In [42]:
type(df["Column 1"])

pandas.core.series.Series

In [45]:
df.loc["A"] #index değerleri

Column 1   -1.124909
Columb 2    0.742529
Column 3   -0.608539
Name: A, dtype: float64

In [48]:
df[["Column 1","Column 3"]]

   Column 1  Column 3
A -1.124909 -0.608539
B  0.985538 -1.564442
C  0.792157 -0.912868

In [49]:
df

   Column 1  Columb 2  Column 3
A -1.124909  0.742529 -0.608539
B  0.985538  0.627922 -1.564442
C  0.792157  1.338160 -0.912868

In [50]:
df["Column 4"]= pd.Series(randn(3),index = ["A","B","C"])

In [51]:
df

   Column 1  Columb 2  Column 3  Column 4
A -1.124909  0.742529 -0.608539  0.217489
B  0.985538  0.627922 -1.564442  0.116838
C  0.792157  1.338160 -0.912868  0.725816

In [55]:
df["Column 5"] = df["Column 1"] + df["Column 3"]

In [56]:
df

   Column 1  Columb 2  Column 3  Column 4  Column 5
A -1.124909  0.742529 -0.608539  0.217489 -1.733448
B  0.985538  0.627922 -1.564442  0.116838 -0.578903
C  0.792157  1.338160 -0.912868  0.725816 -0.120711

In [58]:
df.drop("Column 5",axis = 1)

   Column 1  Columb 2  Column 3  Column 4
A -1.124909  0.742529 -0.608539  0.217489
B  0.985538  0.627922 -1.564442  0.116838
C  0.792157  1.338160 -0.912868  0.725816

In [59]:
df

   Column 1  Columb 2  Column 3  Column 4  Column 5
A -1.124909  0.742529 -0.608539  0.217489 -1.733448
B  0.985538  0.627922 -1.564442  0.116838 -0.578903
C  0.792157  1.338160 -0.912868  0.725816 -0.120711

In [60]:
df.drop("Column 1",axis = 1)

   Columb 2  Column 3  Column 4  Column 5
A  0.742529 -0.608539  0.217489 -1.733448
B  0.627922 -1.564442  0.116838 -0.578903
C  1.338160 -0.912868  0.725816 -0.120711

In [61]:
df.drop("Column 5",axis = 1,inplace = True)#inplace kaydetmeyi sağlar

In [62]:
df

   Column 1  Columb 2  Column 3  Column 4
A -1.124909  0.742529 -0.608539  0.217489
B  0.985538  0.627922 -1.564442  0.116838
C  0.792157  1.338160 -0.912868  0.725816

In [63]:
df["Column 1"]

A   -1.124909
B    0.985538
C    0.792157
Name: Column 1, dtype: float64

In [64]:
df.loc["C"]

Column 1    0.792157
Columb 2    1.338160
Column 3   -0.912868
Column 4    0.725816
Name: C, dtype: float64

In [65]:
df.iloc[0]

Column 1   -1.124909
Columb 2    0.742529
Column 3   -0.608539
Column 4    0.217489
Name: A, dtype: float64

In [66]:
df.iloc[2] #df.loc["C"] eşittir

Column 1    0.792157
Columb 2    1.338160
Column 3   -0.912868
Column 4    0.725816
Name: C, dtype: float64

In [67]:
df.loc["A","Column 1"]

-1.1249090021246035

In [69]:
df.iloc[0,0] #matris gibi

-1.1249090021246035

In [72]:
df.loc[["A","B"],["Column 1","Column 3"]]

   Column 1  Column 3
A -1.124909 -0.608539
B  0.985538 -1.564442

In [73]:
df.iloc[[0,1],[0,1,2]]

   Column 1  Columb 2  Column 3
A -1.124909  0.742529 -0.608539
B  0.985538  0.627922 -1.564442

In [74]:
#************************************
#DATA FRAME FİLTRELEME

In [75]:
df = pd.DataFrame(randn(4,3),["A","B","C","D"],["Column 1","Column 2","Column 3"])

In [76]:
df

   Column 1  Column 2  Column 3
A  0.753226  0.611775 -1.151112
B  0.889109 -0.210529 -1.078057
C  0.185782 -0.970156 -0.042869
D  0.253059 -0.530897 -1.023396

In [77]:
df >-1

   Column 1  Column 2  Column 3
A      True      True     False
B      True      True     False
C      True      True      True
D      True      True     False

In [78]:
booleanDf = df > 0

In [79]:
booleanDf

   Column 1  Column 2  Column 3
A      True      True     False
B      True     False     False
C      True     False     False
D      True     False     False

In [81]:
df[booleanDf]

   Column 1  Column 2  Column 3
A  0.753226  0.611775       NaN
B  0.889109       NaN       NaN
C  0.185782       NaN       NaN
D  0.253059       NaN       NaN

In [82]:
df[df>0]

   Column 1  Column 2  Column 3
A  0.753226  0.611775       NaN
B  0.889109       NaN       NaN
C  0.185782       NaN       NaN
D  0.253059       NaN       NaN

In [83]:
df["Column 1"]

A    0.753226
B    0.889109
C    0.185782
D    0.253059
Name: Column 1, dtype: float64

In [84]:
df["Column 1"]>0

A    True
B    True
C    True
D    True
Name: Column 1, dtype: bool

In [91]:
df[df["Column 2"]>0]

   Column 1  Column 2  Column 3
A  0.753226  0.611775 -1.151112

In [92]:
df[df["Column 2"]>0.5]

   Column 1  Column 2  Column 3
A  0.753226  0.611775 -1.151112

In [93]:
df["Column 2"]>0.5

A     True
B    False
C    False
D    False
Name: Column 2, dtype: bool

In [94]:
df[df["Column 1"]>0]

   Column 1  Column 2  Column 3
A  0.753226  0.611775 -1.151112
B  0.889109 -0.210529 -1.078057
C  0.185782 -0.970156 -0.042869
D  0.253059 -0.530897 -1.023396

In [95]:
df[(df["Column 1"]>0) & (df["Column 2"]>0)] 
#iki koşulu da sağlayan sadece a indisi

   Column 1  Column 2  Column 3
A  0.753226  0.611775 -1.151112

In [96]:
df[(df["Column 1"]>0) | (df["Column 2"]>0)]

   Column 1  Column 2  Column 3
A  0.753226  0.611775 -1.151112
B  0.889109 -0.210529 -1.078057
C  0.185782 -0.970156 -0.042869
D  0.253059 -0.530897 -1.023396

In [97]:
df[(df["Column 3"]>0) | (df["Column 2"]>0)]

   Column 1  Column 2  Column 3
A  0.753226  0.611775 -1.151112

In [98]:
df

   Column 1  Column 2  Column 3
A  0.753226  0.611775 -1.151112
B  0.889109 -0.210529 -1.078057
C  0.185782 -0.970156 -0.042869
D  0.253059 -0.530897 -1.023396

In [99]:
df["Column 4"] =  pd.Series(randn(4),["A","B","C","D"])

In [100]:
df

   Column 1  Column 2  Column 3  Column 4
A  0.753226  0.611775 -1.151112  0.055965
B  0.889109 -0.210529 -1.078057 -0.869139
C  0.185782 -0.970156 -0.042869 -0.320106
D  0.253059 -0.530897 -1.023396 -1.916032

In [101]:
df["Column 5"] = randn(4)

In [102]:
df

   Column 1  Column 2  Column 3  Column 4  Column 5
A  0.753226  0.611775 -1.151112  0.055965  2.543915
B  0.889109 -0.210529 -1.078057 -0.869139  0.204743
C  0.185782 -0.970156 -0.042869 -0.320106 -1.013761
D  0.253059 -0.530897 -1.023396 -1.916032  0.253438

In [103]:
df["Column 6"]=["newValue1","newValue2","newValue3","newValue4"]

In [104]:
df

   Column 1  Column 2  Column 3  Column 4  Column 5   Column 6
A  0.753226  0.611775 -1.151112  0.055965  2.543915  newValue1
B  0.889109 -0.210529 -1.078057 -0.869139  0.204743  newValue2
C  0.185782 -0.970156 -0.042869 -0.320106 -1.013761  newValue3
D  0.253059 -0.530897 -1.023396 -1.916032  0.253438  newValue4

In [106]:
df.set_index("Column 6") #indexlerin adı değişti

           Column 1  Column 2  Column 3  Column 4  Column 5
Column 6
newValue1  0.753226  0.611775 -1.151112  0.055965  2.543915
newValue2  0.889109 -0.210529 -1.078057 -0.869139  0.204743
newValue3  0.185782 -0.970156 -0.042869 -0.320106 -1.013761
newValue4  0.253059 -0.530897 -1.023396 -1.916032  0.253438

In [107]:
df

   Column 1  Column 2  Column 3  Column 4  Column 5   Column 6
A  0.753226  0.611775 -1.151112  0.055965  2.543915  newValue1
B  0.889109 -0.210529 -1.078057 -0.869139  0.204743  newValue2
C  0.185782 -0.970156 -0.042869 -0.320106 -1.013761  newValue3
D  0.253059 -0.530897 -1.023396 -1.916032  0.253438  newValue4

In [108]:
df.set_index("Column 6",inplace=True)

In [109]:
df

           Column 1  Column 2  Column 3  Column 4  Column 5
Column 6
newValue1  0.753226  0.611775 -1.151112  0.055965  2.543915
newValue2  0.889109 -0.210529 -1.078057 -0.869139  0.204743
newValue3  0.185782 -0.970156 -0.042869 -0.320106 -1.013761
newValue4  0.253059 -0.530897 -1.023396 -1.916032  0.253438

In [110]:
df.index.names

FrozenList(['Column 6'])

In [2]:
#**************************************************
#DATAFRAMELERDE MULTİINDEX
#dataframe = bir çok serinin aynı veri kümesinde bulunmasına denir
from random

In [1]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [2]:
outerIndex = ["Group1","Group1","Group1","Group2","Group2","Group2","Group3","Group3","Group3"]

In [3]:
innerIndex = ["Index1","Index2","Index3","Index1","Index2","Index3","Index1","Index2","Index3"]

In [4]:
list(zip(outerIndex,innerIndex))

[('Group1', 'Index1'),
 ('Group1', 'Index2'),
 ('Group1', 'Index3'),
 ('Group2', 'Index1'),
 ('Group2', 'Index2'),
 ('Group2', 'Index3'),
 ('Group3', 'Index1'),
 ('Group3', 'Index2'),
 ('Group3', 'Index3')]

In [5]:
hierarchy = list(zip(outerIndex,innerIndex))

In [12]:
hierarchy = pd.MultiIndex.from_tuples(hierarchy)

In [13]:
hierarchy

MultiIndex([('Group1', 'Index1'),
            ('Group1', 'Index2'),
            ('Group1', 'Index3'),
            ('Group2', 'Index1'),
            ('Group2', 'Index2'),
            ('Group2', 'Index3'),
            ('Group3', 'Index1'),
            ('Group3', 'Index2'),
            ('Group3', 'Index3')],
           )

In [14]:
df = pd.DataFrame(randn(9,3),hierarchy,["Kolum1","Kolum2","Kolum3"])

In [15]:
df

                 Kolum1    Kolum2    Kolum3
Group1 Index1 -0.861583 -0.001272 -1.900361
       Index2  1.044332 -0.402794  0.233411
       Index3 -1.443567 -0.160968 -0.266254
Group2 Index1 -1.099085 -0.853264 -2.634067
       Index2 -0.629288  0.769878 -0.104778
       Index3 -0.137882  0.722457  1.509257
Group3 Index1  0.207208  0.669268 -1.021034
       Index2  0.675993 -0.729500  0.180581
       Index3 -0.407874  1.937506  0.713760

In [16]:
df["Kolum1"]

Group1  Index1   -0.861583
        Index2    1.044332
        Index3   -1.443567
Group2  Index1   -1.099085
        Index2   -0.629288
        Index3   -0.137882
Group3  Index1    0.207208
        Index2    0.675993
        Index3   -0.407874
Name: Kolum1, dtype: float64

In [17]:
df.loc["Group1"]

          Kolum1    Kolum2    Kolum3
Index1 -0.861583 -0.001272 -1.900361
Index2  1.044332 -0.402794  0.233411
Index3 -1.443567 -0.160968 -0.266254

In [18]:
df.loc[["Group1","Group2"]]

                 Kolum1    Kolum2    Kolum3
Group1 Index1 -0.861583 -0.001272 -1.900361
       Index2  1.044332 -0.402794  0.233411
       Index3 -1.443567 -0.160968 -0.266254
Group2 Index1 -1.099085 -0.853264 -2.634067
       Index2 -0.629288  0.769878 -0.104778
       Index3 -0.137882  0.722457  1.509257

In [22]:
df.loc["Group1"].loc["Index1"]["Kolum1"]

-0.8615827850191885

In [23]:
df

                 Kolum1    Kolum2    Kolum3
Group1 Index1 -0.861583 -0.001272 -1.900361
       Index2  1.044332 -0.402794  0.233411
       Index3 -1.443567 -0.160968 -0.266254
Group2 Index1 -1.099085 -0.853264 -2.634067
       Index2 -0.629288  0.769878 -0.104778
       Index3 -0.137882  0.722457  1.509257
Group3 Index1  0.207208  0.669268 -1.021034
       Index2  0.675993 -0.729500  0.180581
       Index3 -0.407874  1.937506  0.713760

In [25]:
df.index.names #isimlendirme

FrozenList([None, None])

In [26]:
df.index.names=["Gruplar","İndeksler"]

In [27]:
df

                     Kolum1    Kolum2    Kolum3
Gruplar İndeksler
Group1  Index1    -0.861583 -0.001272 -1.900361
        Index2     1.044332 -0.402794  0.233411
        Index3    -1.443567 -0.160968 -0.266254
Group2  Index1    -1.099085 -0.853264 -2.634067
        Index2    -0.629288  0.769878 -0.104778
        Index3    -0.137882  0.722457  1.509257
Group3  Index1     0.207208  0.669268 -1.021034
        Index2     0.675993 -0.729500  0.180581
        Index3    -0.407874  1.937506  0.713760

In [28]:
df.loc["Group1"]

             Kolum1    Kolum2    Kolum3
İndeksler
Index1    -0.861583 -0.001272 -1.900361
Index2     1.044332 -0.402794  0.233411
Index3    -1.443567 -0.160968 -0.266254

In [29]:
df.xs("Group1")

             Kolum1    Kolum2    Kolum3
İndeksler
Index1    -0.861583 -0.001272 -1.900361
Index2     1.044332 -0.402794  0.233411
Index3    -1.443567 -0.160968 -0.266254

In [30]:
df.xs("Group1").xs("Index1").xs("Kolum2")

-0.0012723852625187418

In [31]:
df.xs("Index1",level="İndeksler")

           Kolum1    Kolum2    Kolum3
Gruplar
Group1  -0.861583 -0.001272 -1.900361
Group2  -1.099085 -0.853264 -2.634067
Group3   0.207208  0.669268 -1.021034

In [32]:
#****************************************************
#KAYIP VE BOZUK VERİ

In [1]:
import numpy as np
import pandas as pd

In [2]:
arr = np.array([[10,20,np.nan],[5,np.nan,np.nan],[21,np.nan,10]])

In [3]:
arr

array([[10., 20., nan],
       [ 5., nan, nan],
       [21., nan, 10.]])

In [4]:
df = pd.DataFrame(arr,index = ["Index1","Index2","Index3"],columns = ["Column1","Column2","Column3"])

In [5]:
df

        Column1  Column2  Column3
Index1     10.0     20.0      NaN
Index2      5.0      NaN      NaN
Index3     21.0      NaN     10.0

In [11]:
df.dropna() #nan varsa o satırı siler

Empty DataFrame
Columns: [Column1, Column2, Column3]
Index: []

In [12]:
df

        Column1  Column2  Column3
Index1     10.0     20.0      NaN
Index2      5.0      NaN      NaN
Index3     21.0      NaN     10.0

In [15]:
df.dropna(axis = 1)

        Column1
Index1     10.0
Index2      5.0
Index3     21.0

In [16]:
df.dropna(thresh = 2) #min 2 tane nan olmayan değer varsa silinmez

        Column1  Column2  Column3
Index1     10.0     20.0      NaN
Index3     21.0      NaN     10.0

In [17]:
df.dropna(thresh = 3)

Empty DataFrame
Columns: [Column1, Column2, Column3]
Index: []

In [19]:
df.dropna(thresh = 1)

        Column1  Column2  Column3
Index1     10.0     20.0      NaN
Index2      5.0      NaN      NaN
Index3     21.0      NaN     10.0

In [20]:
df.fillna(value=1) #nan yerıne yenı degerler tanımlar

        Column1  Column2  Column3
Index1     10.0     20.0      1.0
Index2      5.0      1.0      1.0
Index3     21.0      1.0     10.0

In [21]:
df.fillna(value =1,inplace = True)

In [22]:
df

        Column1  Column2  Column3
Index1     10.0     20.0      1.0
Index2      5.0      1.0      1.0
Index3     21.0      1.0     10.0

In [24]:
df.sum() #değerleri toplar

Column1    36.0
Column2    22.0
Column3    12.0
dtype: float64

In [29]:
df.sum().sum() #genel verielri toplar

70.0

In [30]:
df = pd.DataFrame(arr,index = ["Index1","Index2","Index3"],columns = ["Column1","Column2","Column3"])

In [31]:
df.size

9

In [32]:
df.isnull() #nan sayıları sayar

        Column1  Column2  Column3
Index1    False    False    False
Index2    False    False    False
Index3    False    False    False

In [33]:
df.isnull().sum()

Column1    0
Column2    0
Column3    0
dtype: int64

In [42]:
arr = np.array([[10,20,np.nan],[5,np.nan,np.nan],[21,np.nan,10]])

In [43]:
df = pd.DataFrame(arr,index = ["Index1","Index2","Index3"],columns = ["Column1","Column2","Column3"])

In [36]:
df.isnull()

        Column1  Column2  Column3
Index1    False    False     True
Index2    False     True     True
Index3    False     True    False

In [51]:
df.isnull().sum()

Column1    0
Column2    2
Column3    2
dtype: int64

In [52]:
df.isnull().sum().sum()

4

In [61]:
df

        Column1  Column2  Column3
Index1     10.0     20.0      NaN
Index2      5.0      NaN      NaN
Index3     21.0      NaN     10.0

In [62]:
def calculateMean(df):
    totalsum=df.sum().sum()
    totalnum=df.size - df.isnull().sum().sum()
    return totalsum/totalnum

In [63]:
df.fillna(value=calculateMean(df))

        Column1  Column2  Column3
Index1     10.0     20.0     13.2
Index2      5.0     13.2     13.2
Index3     21.0     13.2     10.0

In [64]:
df

        Column1  Column2  Column3
Index1     10.0     20.0      NaN
Index2      5.0      NaN      NaN
Index3     21.0      NaN     10.0

In [65]:
df.fillna(value=calculateMean(df),inplace = True)

In [67]:
df

        Column1  Column2  Column3
Index1     10.0     20.0     13.2
Index2      5.0     13.2     13.2
Index3     21.0     13.2     10.0

In [69]:
#************************************************
#GROUPBY OPERASYONU

In [70]:
import numpy as np
import pandas as pd

In [71]:
dataset = {
    "Departman":["Bilişim","İnsan Kaynakları","Üretim","Üretim","Bilişim","İnsan Kaynakları"],
    "Çalışan":["Mustafa","Jale","Kadir","Zeynep","Murat","Ahmet"],
    "Maaş":[3000,3500,2500,4500,4000,2000]
}

In [72]:
df = pd.DataFrame(dataset)

In [73]:
df

          Departman  Çalışan  Maaş
0           Bilişim  Mustafa  3000
1  İnsan Kaynakları     Jale  3500
2            Üretim    Kadir  2500
3            Üretim   Zeynep  4500
4           Bilişim    Murat  4000
5  İnsan Kaynakları    Ahmet  2000

In [74]:
DepGroup = df.groupby("Departman")

In [75]:
DepGroup

In [76]:
DepGroup.sum()

                  Maaş
Departman
Bilişim           7000
Üretim            7000
İnsan Kaynakları  5500

In [77]:
df.groupby("Departman").sum()

                  Maaş
Departman
Bilişim           7000
Üretim            7000
İnsan Kaynakları  5500

In [79]:
df.groupby("Departman").sum().loc["Bilişim"]

Maaş    7000
Name: Bilişim, dtype: int64

In [80]:
int(df.groupby("Departman").sum().loc["Bilişim"])

7000

In [81]:
df.groupby("Departman").count()#çalışan sayısını gösterdi

                  Çalışan  Maaş
Departman
Bilişim                 2     2
Üretim                  2     2
İnsan Kaynakları        2     2

In [83]:
df.groupby("Departman").max() 
#maksimum değerleri getirdi

                  Çalışan  Maaş
Departman
Bilişim           Mustafa  4000
Üretim             Zeynep  4500
İnsan Kaynakları     Jale  3500

In [84]:
df.groupby("Departman").min()

                 Çalışan  Maaş
Departman
Bilişim            Murat  3000
Üretim             Kadir  2500
İnsan Kaynakları   Ahmet  2000

In [87]:
df.groupby("Departman").min()["Maaş"]

Departman
Bilişim             3000
Üretim              2500
İnsan Kaynakları    2000
Name: Maaş, dtype: int64

In [88]:
df.groupby("Departman").min()["Maaş"]["Bilişim"]

3000

In [89]:
df.groupby("Departman").mean()

                    Maaş
Departman
Bilişim           3500.0
Üretim            3500.0
İnsan Kaynakları  2750.0

In [90]:
df.groupby("Departman").mean()["Maaş"]["İnsan Kaynakları"]

2750.0

In [91]:
#**************************************
#Concatenate,Join,Merge
#Concatenate = ekleme -> iki dataframe ister koluma ister indekse göre eklemey sağlar

In [93]:
dataset1 = {
    "A":["A1","A2","A3","A4"],
    "B":["B1","B2","B3","B4"],
    "C":["C1","C2","C3","C4",]
}
dataset2= {
    "A":["A5","A6","A7","A8"],
    "B":["B5","B6","B7","B8"],
    "C":["C5","C6","C7","C8",]
}
df1 = pd.DataFrame(dataset1,index = [1,2,3,4])
df2= pd.DataFrame(dataset2,index= [5,6,7,8])

In [94]:
df1

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3
4  A4  B4  C4

In [95]:
df2

    A   B   C
5  A5  B5  C5
6  A6  B6  C6
7  A7  B7  C7
8  A8  B8  C8

In [96]:
pd.concat([df1,df2]) #Concatenate

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3
4  A4  B4  C4
5  A5  B5  C5
6  A6  B6  C6
7  A7  B7  C7
8  A8  B8  C8

In [98]:
pd.concat([df1,df2],axis=1) # yan yana toplar

     A    B    C    A    B    C
1   A1   B1   C1  NaN  NaN  NaN
2   A2   B2   C2  NaN  NaN  NaN
3   A3   B3   C3  NaN  NaN  NaN
4   A4   B4   C4  NaN  NaN  NaN
5  NaN  NaN  NaN   A5   B5   C5
6  NaN  NaN  NaN   A6   B6   C6
7  NaN  NaN  NaN   A7   B7   C7
8  NaN  NaN  NaN   A8   B8   C8

In [99]:
#join

In [100]:
dataset1 = {
    "A":["A1","A2","A3","A4"],
    "B":["B1","B2","B3","B4"],
}
dataset2 = {
    "X":["X1","X2","X3"],
    "Y":["Y1","Y2","Y3"],
}
df1=pd.DataFrame(dataset1,index=[1,2,3,4])
df2=pd.DataFrame(dataset2,index=[1,2,3])

In [101]:
df1

    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [102]:
df2

    X   Y
1  X1  Y1
2  X2  Y2
3  X3  Y3

In [103]:
df1.join(df2)

    A   B    X    Y
1  A1  B1   X1   Y1
2  A2  B2   X2   Y2
3  A3  B3   X3   Y3
4  A4  B4  NaN  NaN

In [104]:
df2.join(df1)

    X   Y   A   B
1  X1  Y1  A1  B1
2  X2  Y2  A2  B2
3  X3  Y3  A3  B3

#Merge

In [108]:
dataset1 = {
    "A":["A1","A2","A3"],
    "B":["B1","B2","B3"],
    "anahtar":["K1","K2","K3"]
}
dataset2 = {
    "X":["X1","X2","X3","X4"],
    "Y":["Y1","Y2","Y3","Y4"],
    "anahtar":["K1","K2","K5","K4"]
}
df1=pd.DataFrame(dataset1,index=[1,2,3])
df2=pd.DataFrame(dataset2,index=[1,2,3,4])

In [109]:
df1

    A   B anahtar
1  A1  B1      K1
2  A2  B2      K2
3  A3  B3      K3

In [110]:
df2

    X   Y anahtar
1  X1  Y1      K1
2  X2  Y2      K2
3  X3  Y3      K5
4  X4  Y4      K4

In [112]:
df1.merge(df2)
#kesişim kümesi alınırmış gibi
#ortakları alır

    A   B anahtar   X   Y
0  A1  B1      K1  X1  Y1
1  A2  B2      K2  X2  Y2

In [113]:
#JOİN İNDEKSLER ÜZERİNDEN 
#MERGE COLUMN LARDAN YAPILIR

In [115]:
pd.merge(df1,df2,on="anahtar")

    A   B anahtar   X   Y
0  A1  B1      K1  X1  Y1
1  A2  B2      K2  X2  Y2

In [116]:
#******************************************************
#DATAFRAME OPERASYONLARI - PİVOT TABLET

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({
    "Column1":[1,2,3,4,5,6],
    "Column2":[100,100,200,300,300,100],
    "Column3":["Mustafa","Kamil","Emre","Ayşe","Murat","Zeynep"]
})

In [3]:
df

   Column1  Column2  Column3
0        1      100  Mustafa
1        2      100    Kamil
2        3      200     Emre
3        4      300     Ayşe
4        5      300    Murat
5        6      100   Zeynep

In [4]:
df.head()
#ilk 5 değer gelecek

   Column1  Column2  Column3
0        1      100  Mustafa
1        2      100    Kamil
2        3      200     Emre
3        4      300     Ayşe
4        5      300    Murat

In [5]:
df.head(n=3)

   Column1  Column2  Column3
0        1      100  Mustafa
1        2      100    Kamil
2        3      200     Emre

In [8]:
df["Column2"].unique()
#içindeki değerleri verir

array([100, 200, 300], dtype=int64)

In [9]:
df["Column2"].nunique()
#3 farklı değer varmış

3

In [11]:
df["Column2"].value_counts()

100    3
300    2
200    1
Name: Column2, dtype: int64

In [12]:
df

   Column1  Column2  Column3
0        1      100  Mustafa
1        2      100    Kamil
2        3      200     Emre
3        4      300     Ayşe
4        5      300    Murat
5        6      100   Zeynep

In [13]:
df[(df["Column1"]>=4) & (df["Column2"]==300)]

   Column1  Column2 Column3
3        4      300    Ayşe
4        5      300   Murat

In [14]:
def times3(x):
    return x*3

In [15]:
times3(6)

18

In [16]:
df["Column2"].apply(times3)

0    300
1    300
2    600
3    900
4    900
5    300
Name: Column2, dtype: int64

In [17]:
times3(df["Column2"])

0    300
1    300
2    600
3    900
4    900
5    300
Name: Column2, dtype: int64

In [18]:
df["Column2"] = times3(df["Column2"])

In [19]:
df

   Column1  Column2  Column3
0        1      300  Mustafa
1        2      300    Kamil
2        3      600     Emre
3        4      900     Ayşe
4        5      900    Murat
5        6      300   Zeynep

In [20]:
murat = lambda x : x*2

In [21]:
murat(6)

12

In [22]:
murat(df["Column2"])

0     600
1     600
2    1200
3    1800
4    1800
5     600
Name: Column2, dtype: int64

In [23]:
df["Column2"].apply(murat)

0     600
1     600
2    1200
3    1800
4    1800
5     600
Name: Column2, dtype: int64

In [24]:
df["Column2"].apply(lambda x : x*2)

0     600
1     600
2    1200
3    1800
4    1800
5     600
Name: Column2, dtype: int64

In [25]:
df["Column3"].apply(len)

0    7
1    5
2    4
3    4
4    5
5    6
Name: Column3, dtype: int64

In [26]:
df.drop("Column3",axis=1)

   Column1  Column2
0        1      300
1        2      300
2        3      600
3        4      900
4        5      900
5        6      300

In [27]:
df

   Column1  Column2  Column3
0        1      300  Mustafa
1        2      300    Kamil
2        3      600     Emre
3        4      900     Ayşe
4        5      900    Murat
5        6      300   Zeynep

In [28]:
df.drop("Column3",axis = 1,inplace=True)

In [29]:
df

   Column1  Column2
0        1      300
1        2      300
2        3      600
3        4      900
4        5      900
5        6      300

In [30]:
df.columns

Index(['Column1', 'Column2'], dtype='object')

In [31]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [32]:
len(df.index)

6

In [33]:
df.index.names

FrozenList([None])

In [35]:
df.sort_values("Column2")

   Column1  Column2
0        1      300
1        2      300
5        6      300
2        3      600
3        4      900
4        5      900

In [36]:
df.sort_values("Column2",ascending = False)

   Column1  Column2
3        4      900
4        5      900
2        3      600
0        1      300
1        2      300
5        6      300

In [37]:
df = pd.DataFrame({
    "Ay":["Mart","Nisan","Mayıs","Mart","Nisan","Mayıs","Mart","Nisan","Mayıs"],
    "Şehir":["Ankara","Ankara","Ankara","İstanbul","İstanbul","İstanbul","İzmir","İzmir","İzmir"],
    "Nem":[10,25,50,21,67,80,30,70,75]
})

In [38]:
df

      Ay     Şehir  Nem
0   Mart    Ankara   10
1  Nisan    Ankara   25
2  Mayıs    Ankara   50
3   Mart  İstanbul   21
4  Nisan  İstanbul   67
5  Mayıs  İstanbul   80
6   Mart     İzmir   30
7  Nisan     İzmir   70
8  Mayıs     İzmir   75

In [39]:
df.pivot_table(index = "Ay",columns = "Şehir",values = "Nem")

Şehir  Ankara  İstanbul  İzmir
Ay
Mart       10        21     30
Mayıs      50        80     75
Nisan      25        67     70

In [40]:
df.pivot_table(index = "Şehir",columns = "Ay",values = "Nem")

Ay        Mart  Mayıs  Nisan
Şehir
Ankara      10     50     25
İstanbul    21     80     67
İzmir       30     75     70

In [41]:
#**************************************************
#DATASET OKUMA YÖNTEMİ

In [6]:
import pandas as pd

In [7]:
dataset = pd.read_csv("USvideos.csv")

In [8]:
dataset

,video_id,trending_date,title,channel_title,category_id,publish_time,tags,views,likes,dislikes,comment_count,thumbnail_link,comments_disabled,ratings_disabled,video_error_or_removed,description
0,2kyS6SvSYSE,17.14.11,WE WANT TO TALK ABOUT OUR MARRIAGE,CaseyNeistat,22,2017-11-13T17:13:01.000Z,SHANtell martin,748374,57527,2966,15954,https://i.ytimg.com/vi/2kyS6SvSYSE/default.jpg,False,False,False,SHANTELL'S CHANNEL - https://www.youtube.com/s...
1,1ZAPwfrtAFY,17.14.11,The Trump Presidency: Last Week Tonight with J...,LastWeekTonight,24,2017-11-13T07:30:00.000Z,"last week tonight trump presidency|""last week ...",2418783,97185,6146,12703,https://i.ytimg.com/vi/1ZAPwfrtAFY/default.jpg,False,False,False,"One year after the presidential election, John..."
2,5qpjK5DgCt4,17.14.11,"Racist Superman | Rudy Mancuso, King Bach & Le...",Rudy Mancuso,23,2017-11-12T19:05:24.000Z,"racist superman|""rudy""|""mancuso""|""king""|""bach""...",3191434,146033,5339,8181,https://i.ytimg.com/vi/5qpjK5DgCt4/default.jpg,False,False,False,WATCH MY PREVIOUS VIDEO ▶ \n\nSUBSCRIBE ► http...
3,puqaWrEC7tY,17.14.11,Nickelback Lyrics: Real or Fake?,Good Mythical Morning,24,2017-11-13T11:00:04.000Z,"rhett and link|""gmm""|""good mythical morning""|""...",343168,10172,666,2146,https://i.ytimg.com/vi/puqaWrEC7tY/default.jpg,False,False,False,Today we find out if Link is a Nickelback amat...
4,d380meD0W0M,17.14.11,I Dare You: GOING BALD!?,nigahiga,24,2017-11-12T18:01:41.000Z,"ryan|""higa""|""higatv""|""nigahiga""|""i dare you""|""...",2095731,132235,1989,17518,https://i.ytimg.com/vi/d380meD0W0M/default.jpg,False,False,False,I know it's been a while since we did this sho...
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
23357,pH7VfJDq7f4,18.12.03,Why Bridges Move...,Practical Engineering,27,2018-02-27T12:00:08.000Z,"thermal expansion|""expansion joint""|""thermal m...",456470,14826,279,820,https://i.ytimg.com/vi/pH7VfJDq7f4/default.jpg,False,False,False,...and other musings on thermal movement of la...
23358,hV-yHbbrKRA,18.12.03,Macaroni - A Recipe From 1784,Townsends,27,2018-02-26T21:23:39.000Z,"townsends|""jas townsend and son""|""reenacting""|...",519220,13600,329,1350,https://i.ytimg.com/vi/hV-yHbbrKRA/default.jpg,False,False,False,Visit Our Website! ▶ http://www.townsends.us/ ...
23359,CwKp6Xhy3_4,18.12.03,Chris Young - Hangin' On,ChrisYoungVEVO,10,2018-02-26T08:00:02.000Z,"Losing sleep video|""losing sleep album""|""think...",1117570,7504,584,324,https://i.ytimg.com/vi/CwKp6Xhy3_4/default.jpg,False,False,False,Chris Young's Hangin' On from his #1 album Los...
23360,vQiiNGllGQo,18.12.03,Elderly man making sure his dog won't get wet,"Rock me, Joey Santiago.",15,2018-02-26T11:09:32.000Z,"dog|""cute""|""adorable""|""doggo""|""doge""|""old""|""ma...",713574,12448,146,1474,https://i.ytimg.com/vi/vQiiNGllGQo/default.jpg,False,False,False,very wholesome stuff.\n\nThis video was taken ...
23361,2afSbqlp5HU,18.12.03,How to speak like Black Panther - BBC News,BBC News,1,2018-02-27T12:26:49.000Z,"bbc|""bbc news""|""news""|""black panther""|""black p...",422979,7408,1344,1548,https://i.ytimg.com/vi/2afSbqlp5HU/default.jpg,False,False,False,The new marvel film Black Panther is set in th...

In [9]:
newdataset1 = dataset.drop(["video_id","trending_date"],axis = 1)

In [10]:
newdataset1

,title,channel_title,category_id,publish_time,tags,views,likes,dislikes,comment_count,thumbnail_link,comments_disabled,ratings_disabled,video_error_or_removed,description
0,WE WANT TO TALK ABOUT OUR MARRIAGE,CaseyNeistat,22,2017-11-13T17:13:01.000Z,SHANtell martin,748374,57527,2966,15954,https://i.ytimg.com/vi/2kyS6SvSYSE/default.jpg,False,False,False,SHANTELL'S CHANNEL - https://www.youtube.com/s...
1,The Trump Presidency: Last Week Tonight with J...,LastWeekTonight,24,2017-11-13T07:30:00.000Z,"last week tonight trump presidency|""last week ...",2418783,97185,6146,12703,https://i.ytimg.com/vi/1ZAPwfrtAFY/default.jpg,False,False,False,"One year after the presidential election, John..."
2,"Racist Superman | Rudy Mancuso, King Bach & Le...",Rudy Mancuso,23,2017-11-12T19:05:24.000Z,"racist superman|""rudy""|""mancuso""|""king""|""bach""...",3191434,146033,5339,8181,https://i.ytimg.com/vi/5qpjK5DgCt4/default.jpg,False,False,False,WATCH MY PREVIOUS VIDEO ▶ \n\nSUBSCRIBE ► http...
3,Nickelback Lyrics: Real or Fake?,Good Mythical Morning,24,2017-11-13T11:00:04.000Z,"rhett and link|""gmm""|""good mythical morning""|""...",343168,10172,666,2146,https://i.ytimg.com/vi/puqaWrEC7tY/default.jpg,False,False,False,Today we find out if Link is a Nickelback amat...
4,I Dare You: GOING BALD!?,nigahiga,24,2017-11-12T18:01:41.000Z,"ryan|""higa""|""higatv""|""nigahiga""|""i dare you""|""...",2095731,132235,1989,17518,https://i.ytimg.com/vi/d380meD0W0M/default.jpg,False,False,False,I know it's been a while since we did this sho...
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
23357,Why Bridges Move...,Practical Engineering,27,2018-02-27T12:00:08.000Z,"thermal expansion|""expansion joint""|""thermal m...",456470,14826,279,820,https://i.ytimg.com/vi/pH7VfJDq7f4/default.jpg,False,False,False,...and other musings on thermal movement of la...
23358,Macaroni - A Recipe From 1784,Townsends,27,2018-02-26T21:23:39.000Z,"townsends|""jas townsend and son""|""reenacting""|...",519220,13600,329,1350,https://i.ytimg.com/vi/hV-yHbbrKRA/default.jpg,False,False,False,Visit Our Website! ▶ http://www.townsends.us/ ...
23359,Chris Young - Hangin' On,ChrisYoungVEVO,10,2018-02-26T08:00:02.000Z,"Losing sleep video|""losing sleep album""|""think...",1117570,7504,584,324,https://i.ytimg.com/vi/CwKp6Xhy3_4/default.jpg,False,False,False,Chris Young's Hangin' On from his #1 album Los...
23360,Elderly man making sure his dog won't get wet,"Rock me, Joey Santiago.",15,2018-02-26T11:09:32.000Z,"dog|""cute""|""adorable""|""doggo""|""doge""|""old""|""ma...",713574,12448,146,1474,https://i.ytimg.com/vi/vQiiNGllGQo/default.jpg,False,False,False,very wholesome stuff.\n\nThis video was taken ...
23361,How to speak like Black Panther - BBC News,BBC News,1,2018-02-27T12:26:49.000Z,"bbc|""bbc news""|""news""|""black panther""|""black p...",422979,7408,1344,1548,https://i.ytimg.com/vi/2afSbqlp5HU/default.jpg,False,False,False,The new marvel film Black Panther is set in th...

In [14]:
newdataset1.to_csv("USVideos.csv")

In [15]:
newdataset1.to_csv("USVideos2.csv",index = False)

In [17]:
excelset = pd.read_excel("excelfile.xlsx")

In [18]:
excelset

  Unnamed: 0  Column1  Column2  Column3  Column4
0     Index1       10       50       90      130
1     Index2       20       60      100      140
2     Index3       30       70      110      150
3     Index4       40       80      120      160

In [19]:
excelset["Column5"]=[120,321,112,90]

In [20]:
excelset

  Unnamed: 0  Column1  Column2  Column3  Column4  Column5
0     Index1       10       50       90      130      120
1     Index2       20       60      100      140      321
2     Index3       30       70      110      150      112
3     Index4       40       80      120      160       90

In [21]:
excelset.to_excel("excelfilenew.xlsx")

In [22]:
new = pd.read_html("https://contextures.com/xlsampledata01.html#data")

In [23]:
new

[             0        1         2        3      4         5        6
 0    OrderDate   Region       Rep     Item  Units  UnitCost    Total
 1     1/6/2020     East     Jones   Pencil     95      1.99   189.05
 2    1/23/2020  Central    Kivell   Binder     50     19.99   999.50
 3     2/9/2020  Central   Jardine   Pencil     36      4.99   179.64
 4    2/26/2020  Central      Gill      Pen     27     19.99   539.73
 5    3/15/2020     West   Sorvino   Pencil     56      2.99   167.44
 6     4/1/2020     East     Jones   Binder     60      4.99   299.40
 7    4/18/2020  Central   Andrews   Pencil     75      1.99   149.25
 8     5/5/2020  Central   Jardine   Pencil     90      4.99   449.10
 9    5/22/2020     West  Thompson   Pencil     32      1.99    63.68
 10    6/8/2020     East     Jones   Binder     60      8.99   539.40
 11   6/25/2020  Central    Morgan   Pencil     90      4.99   449.10
 12   7/12/2020     East    Howard   Binder     29      1.99    57.71
 13   7/29/2020     East    Parent   Binder     81     19.99  1619.19
 14   8/15/2020     East     Jones   Pencil     35      4.99   174.65
 15    9/1/2020  Central     Smith     Desk      2    125.00   250.00
 16   9/18/2020     East     Jones  Pen Set     16     15.99   255.84
 17   10/5/2020  Central    Morgan   Binder     28      8.99   251.72
 18  10/22/2020     East     Jones      Pen     64      8.99   575.36
 19   11/8/2020     East    Parent      Pen     15     19.99   299.85
 20  11/25/2020  Central    Kivell  Pen Set     96      4.99   479.04
 21  12/12/2020  Central     Smith   Pencil     67      1.29    86.43
 22  12/29/2020     East    Parent  Pen Set     74     15.99  1183.26
 23   1/15/2021  Central      Gill   Binder     46      8.99   413.54
 24    2/1/2021  Central     Smith   Binder     87     15.00  1305.00
 25   2/18/2021     East     Jones   Binder      4      4.99    19.96
 26    3/7/2021     West   Sorvino   Binder      7     19.99   139.93
 27   3/24/2021  Central   Jardine  Pen Set     50      4.99   249.50
 28   4/10/2021  Central   Andrews   Pencil     66      1.99   131.34
 29   4/27/2021     East    Howard      Pen     96      4.99   479.04
 30   5/14/2021  Central      Gill   Pencil     53      1.29    68.37
 31   5/31/2021  Central      Gill   Binder     80      8.99   719.20
 32   6/17/2021  Central    Kivell     Desk      5    125.00   625.00
 33    7/4/2021     East     Jones  Pen Set     62      4.99   309.38
 34   7/21/2021  Central    Morgan  Pen Set     55     12.49   686.95
 35    8/7/2021  Central    Kivell  Pen Set     42     23.95  1005.90
 36   8/24/2021     West   Sorvino     Desk      3    275.00   825.00
 37   9/10/2021  Central      Gill   Pencil      7      1.29     9.03
 38   9/27/2021     West   Sorvino      Pen     76      1.99   151.24
 39  10/14/2021     West  Thompson   Binder     57     19.99  1139.43
 40  10/31/2021  Central   Andrews   Pencil     14      1.29    18.06
 41  11/17/2021  Central   Jardine   Binder     11      4.99    54.89
 42   12/4/2021  Central   Jardine   Binder     94     19.99  1879.06
 43  12/21/2021  Central   Andrews   Binder     28      4.99   139.72]

In [24]:
len(new)

1

In [25]:
new[0]

             0        1         2        3      4         5        6
0    OrderDate   Region       Rep     Item  Units  UnitCost    Total
1     1/6/2020     East     Jones   Pencil     95      1.99   189.05
2    1/23/2020  Central    Kivell   Binder     50     19.99   999.50
3     2/9/2020  Central   Jardine   Pencil     36      4.99   179.64
4    2/26/2020  Central      Gill      Pen     27     19.99   539.73
5    3/15/2020     West   Sorvino   Pencil     56      2.99   167.44
6     4/1/2020     East     Jones   Binder     60      4.99   299.40
7    4/18/2020  Central   Andrews   Pencil     75      1.99   149.25
8     5/5/2020  Central   Jardine   Pencil     90      4.99   449.10
9    5/22/2020     West  Thompson   Pencil     32      1.99    63.68
10    6/8/2020     East     Jones   Binder     60      8.99   539.40
11   6/25/2020  Central    Morgan   Pencil     90      4.99   449.10
12   7/12/2020     East    Howard   Binder     29      1.99    57.71
13   7/29/2020     East    Parent   Binder     81     19.99  1619.19
14   8/15/2020     East     Jones   Pencil     35      4.99   174.65
15    9/1/2020  Central     Smith     Desk      2    125.00   250.00
16   9/18/2020     East     Jones  Pen Set     16     15.99   255.84
17   10/5/2020  Central    Morgan   Binder     28      8.99   251.72
18  10/22/2020     East     Jones      Pen     64      8.99   575.36
19   11/8/2020     East    Parent      Pen     15     19.99   299.85
20  11/25/2020  Central    Kivell  Pen Set     96      4.99   479.04
21  12/12/2020  Central     Smith   Pencil     67      1.29    86.43
22  12/29/2020     East    Parent  Pen Set     74     15.99  1183.26
23   1/15/2021  Central      Gill   Binder     46      8.99   413.54
24    2/1/2021  Central     Smith   Binder     87     15.00  1305.00
25   2/18/2021     East     Jones   Binder      4      4.99    19.96
26    3/7/2021     West   Sorvino   Binder      7     19.99   139.93
27   3/24/2021  Central   Jardine  Pen Set     50      4.99   249.50
28   4/10/2021  Central   Andrews   Pencil     66      1.99   131.34
29   4/27/2021     East    Howard      Pen     96      4.99   479.04
30   5/14/2021  Central      Gill   Pencil     53      1.29    68.37
31   5/31/2021  Central      Gill   Binder     80      8.99   719.20
32   6/17/2021  Central    Kivell     Desk      5    125.00   625.00
33    7/4/2021     East     Jones  Pen Set     62      4.99   309.38
34   7/21/2021  Central    Morgan  Pen Set     55     12.49   686.95
35    8/7/2021  Central    Kivell  Pen Set     42     23.95  1005.90
36   8/24/2021     West   Sorvino     Desk      3    275.00   825.00
37   9/10/2021  Central      Gill   Pencil      7      1.29     9.03
38   9/27/2021     West   Sorvino      Pen     76      1.99   151.24
39  10/14/2021     West  Thompson   Binder     57     19.99  1139.43
40  10/31/2021  Central   Andrews   Pencil     14      1.29    18.06
41  11/17/2021  Central   Jardine   Binder     11      4.99    54.89
42   12/4/2021  Central   Jardine   Binder     94     19.99  1879.06
43  12/21/2021  Central   Andrews   Binder     28      4.99   139.72

In [26]:
new = pd.read_html("https://contextures.com/xlsampledata01.html#data",header = 0)

In [28]:
new[0]

     OrderDate   Region       Rep     Item  Units  UnitCost    Total
0     1/6/2020     East     Jones   Pencil     95      1.99   189.05
1    1/23/2020  Central    Kivell   Binder     50     19.99   999.50
2     2/9/2020  Central   Jardine   Pencil     36      4.99   179.64
3    2/26/2020  Central      Gill      Pen     27     19.99   539.73
4    3/15/2020     West   Sorvino   Pencil     56      2.99   167.44
5     4/1/2020     East     Jones   Binder     60      4.99   299.40
6    4/18/2020  Central   Andrews   Pencil     75      1.99   149.25
7     5/5/2020  Central   Jardine   Pencil     90      4.99   449.10
8    5/22/2020     West  Thompson   Pencil     32      1.99    63.68
9     6/8/2020     East     Jones   Binder     60      8.99   539.40
10   6/25/2020  Central    Morgan   Pencil     90      4.99   449.10
11   7/12/2020     East    Howard   Binder     29      1.99    57.71
12   7/29/2020     East    Parent   Binder     81     19.99  1619.19
13   8/15/2020     East     Jones   Pencil     35      4.99   174.65
14    9/1/2020  Central     Smith     Desk      2    125.00   250.00
15   9/18/2020     East     Jones  Pen Set     16     15.99   255.84
16   10/5/2020  Central    Morgan   Binder     28      8.99   251.72
17  10/22/2020     East     Jones      Pen     64      8.99   575.36
18   11/8/2020     East    Parent      Pen     15     19.99   299.85
19  11/25/2020  Central    Kivell  Pen Set     96      4.99   479.04
20  12/12/2020  Central     Smith   Pencil     67      1.29    86.43
21  12/29/2020     East    Parent  Pen Set     74     15.99  1183.26
22   1/15/2021  Central      Gill   Binder     46      8.99   413.54
23    2/1/2021  Central     Smith   Binder     87     15.00  1305.00
24   2/18/2021     East     Jones   Binder      4      4.99    19.96
25    3/7/2021     West   Sorvino   Binder      7     19.99   139.93
26   3/24/2021  Central   Jardine  Pen Set     50      4.99   249.50
27   4/10/2021  Central   Andrews   Pencil     66      1.99   131.34
28   4/27/2021     East    Howard      Pen     96      4.99   479.04
29   5/14/2021  Central      Gill   Pencil     53      1.29    68.37
30   5/31/2021  Central      Gill   Binder     80      8.99   719.20
31   6/17/2021  Central    Kivell     Desk      5    125.00   625.00
32    7/4/2021     East     Jones  Pen Set     62      4.99   309.38
33   7/21/2021  Central    Morgan  Pen Set     55     12.49   686.95
34    8/7/2021  Central    Kivell  Pen Set     42     23.95  1005.90
35   8/24/2021     West   Sorvino     Desk      3    275.00   825.00
36   9/10/2021  Central      Gill   Pencil      7      1.29     9.03
37   9/27/2021     West   Sorvino      Pen     76      1.99   151.24
38  10/14/2021     West  Thompson   Binder     57     19.99  1139.43
39  10/31/2021  Central   Andrews   Pencil     14      1.29    18.06
40  11/17/2021  Central   Jardine   Binder     11      4.99    54.89
41   12/4/2021  Central   Jardine   Binder     94     19.99  1879.06
42  12/21/2021  Central   Andrews   Binder     28      4.99   139.72

In [30]:
#***************************************************************************
#örnek işlem

In [31]:
import pandas as pd

In [34]:
soccer = pd.read_csv("mls-salaries-2017.csv")

In [35]:
soccer

,club,last_name,first_name,position,base_salary,guaranteed_compensation
0,ATL,Almiron,Miguel,M,1912500.0,2297000.00
1,ATL,Ambrose,Mikey,D,65625.0,65625.00
2,ATL,Asad,Yamil,M,150000.0,150000.00
3,ATL,Bloom,Mark,D,99225.0,106573.89
4,ATL,Carleton,Andrew,F,65000.0,77400.00
...,...,...,...,...,...,...
611,VAN,Tornaghi,Paolo,GK,80000.0,80000.00
612,VAN,Waston,Kendall,D,350000.0,368125.00
613,VAN,Williams,Sheanon,D,175000.0,184000.00
614,NaN,Babouli,Mo,F,54075.0,54075.00
615,NaN,Ramajo,David Mateos,D,420000.0,453333.33

In [36]:
soccer.head(10)

,club,last_name,first_name,position,base_salary,guaranteed_compensation
0,ATL,Almiron,Miguel,M,1912500.0,2297000.00
1,ATL,Ambrose,Mikey,D,65625.0,65625.00
2,ATL,Asad,Yamil,M,150000.0,150000.00
3,ATL,Bloom,Mark,D,99225.0,106573.89
4,ATL,Carleton,Andrew,F,65000.0,77400.00
5,ATL,Carmona,Carlos,M,675000.0,725000.00
6,ATL,Garza,Greg,D,150000.0,150000.00
7,ATL,Gonzalez Pirez,Leandro,D,250008.0,285008.00
8,ATL,Goslin,Chris,M,70000.0,74000.00
9,ATL,Gressel,Julian,M,75000.0,93750.00

In [38]:
soccer.index

RangeIndex(start=0, stop=616, step=1)

In [39]:
len(soccer.index)

616

In [40]:
soccer["base_salary"] #maaşları

0      1912500.0
1        65625.0
2       150000.0
3        99225.0
4        65000.0
         ...
611      80000.0
612     350000.0
613     175000.0
614      54075.0
615     420000.0
Name: base_salary, Length: 616, dtype: float64

In [41]:
soccer["base_salary"].mean()

296977.73686688306

In [42]:
soccer["base_salary"].max()

6660000.0

In [43]:
soccer["guaranteed_compensation"].max()

7167500.0

In [49]:
soccer[soccer["guaranteed_compensation"] == soccer["guaranteed_compensation"].max()]

    club last_name first_name position  base_salary  guaranteed_compensation
401  ORL      Kaka        NaN        M    6660000.0                7167500.0

In [51]:
soccer[soccer["guaranteed_compensation"] == soccer["guaranteed_compensation"].max()]["last_name"].iloc[0]

'Kaka'

In [52]:
soccer[soccer["last_name"]=="Gonzalez Pirez"]["position"].iloc[0]

'D'

In [53]:
soccer.groupby("position").mean()

            base_salary  guaranteed_compensation
position
D         166574.093784            179533.184811
D-M       134930.000000            154328.927857
F         489588.598349            557437.206514
F-M       335834.000000            367920.805000
F/M       125000.000000            131250.000000
GK        146472.515538            158665.155692
M         376106.218632            406781.788396
M-D       219032.250000            230282.250000
M-F       212975.604211            231104.551579
M/F       550000.000000            565000.000000

In [54]:
soccer["position"].nunique()

10

In [56]:
soccer["position"].value_counts()

M      212
D      185
F      109
GK      65
M-F     19
D-M     14
F-M      6
M-D      4
M/F      1
F/M      1
Name: position, dtype: int64

In [57]:
soccer["club"].value_counts()

VAN      32
PHI      31
ATL      31
CLB      30
ORL      30
DAL      29
SJ       29
NYCFC    28
HOU      28
NYRB     28
TOR      27
RSL      27
POR      27
MTL      27
CHI      27
MNUFC    27
LA       27
DC       27
KC       26
COL      26
SEA      25
NE       23
LAFC      2
Name: club, dtype: int64

In [58]:
def son_find(last_name):
    if "son" in last_name.lower():
        return True
    return False

soccer["last_name"].apply(son_find)

0      False
1      False
2      False
3      False
4      False
       ...
611    False
612    False
613    False
614    False
615    False
Name: last_name, Length: 616, dtype: bool

In [59]:
soccer[soccer["last_name"].apply(son_find)]

,club,last_name,first_name,position,base_salary,guaranteed_compensation
21,ATL,Peterson,Jacob,F,165300.00,165300.00
23,ATL,Robinson,Miles,D,125000.04,195000.04
45,CHI,Johnson,Daniel,M,65004.00,65004.00
48,CHI,Lampson,Matt,GK,76000.00,81375.00
85,CLB,Swanson,Ben,M,85000.00,105416.67
163,DC,Robinson,Jalen,D,69996.00,69996.00
233,LA,Jamieson,Bradford,F,66150.00,66150.00
265,MNUFC,Ibson,NaN,M,200004.00,210337.40
276,MNUFC,Thiesson,Jerome,D,171000.00,210166.67
295,MTL,Jackson-Hamel,Anthony,F,66150.00,66150.00
327,NE,Watson,Je-Vaughn,D-M,150000.00,155666.67
338,NYCFC,Harrison,Jack,M,130000.00,165500.00
341,NYCFC,Johnson,Sean,GK,220008.00,220008.00
400,ORL,Johnson,Will,M,414000.00,450000.00
442,PHI,Simpson,Jay,F,465000.00,508333.33
459,POR,Gleeson,Jake,GK,110000.00,115166.67
522,SEA,Svensson,Gustav,M,170000.04,170000.04
550,SJ,Thompson,Tommy,M,150000.00,155000.00
594,VAN,Jacobson,Andrew,M,150000.00,175000.00

In [60]:
#******************************************************
#yeniörnek

In [71]:
import pandas as pd

In [72]:
youtube = pd.read_csv("Usvideos.csv")

In [73]:
youtube.head()

,video_id,trending_date,title,channel_title,category_id,publish_time,tags,views,likes,dislikes,comment_count,thumbnail_link,comments_disabled,ratings_disabled,video_error_or_removed,description
0,2kyS6SvSYSE,17.14.11,WE WANT TO TALK ABOUT OUR MARRIAGE,CaseyNeistat,22,2017-11-13T17:13:01.000Z,SHANtell martin,748374,57527,2966,15954,https://i.ytimg.com/vi/2kyS6SvSYSE/default.jpg,False,False,False,SHANTELL'S CHANNEL - https://www.youtube.com/s...
1,1ZAPwfrtAFY,17.14.11,The Trump Presidency: Last Week Tonight with J...,LastWeekTonight,24,2017-11-13T07:30:00.000Z,"last week tonight trump presidency|""last week ...",2418783,97185,6146,12703,https://i.ytimg.com/vi/1ZAPwfrtAFY/default.jpg,False,False,False,"One year after the presidential election, John..."
2,5qpjK5DgCt4,17.14.11,"Racist Superman | Rudy Mancuso, King Bach & Le...",Rudy Mancuso,23,2017-11-12T19:05:24.000Z,"racist superman|""rudy""|""mancuso""|""king""|""bach""...",3191434,146033,5339,8181,https://i.ytimg.com/vi/5qpjK5DgCt4/default.jpg,False,False,False,WATCH MY PREVIOUS VIDEO ▶ \n\nSUBSCRIBE ► http...
3,puqaWrEC7tY,17.14.11,Nickelback Lyrics: Real or Fake?,Good Mythical Morning,24,2017-11-13T11:00:04.000Z,"rhett and link|""gmm""|""good mythical morning""|""...",343168,10172,666,2146,https://i.ytimg.com/vi/puqaWrEC7tY/default.jpg,False,False,False,Today we find out if Link is a Nickelback amat...
4,d380meD0W0M,17.14.11,I Dare You: GOING BALD!?,nigahiga,24,2017-11-12T18:01:41.000Z,"ryan|""higa""|""higatv""|""nigahiga""|""i dare you""|""...",2095731,132235,1989,17518,https://i.ytimg.com/vi/d380meD0W0M/default.jpg,False,False,False,I know it's been a while since we did this sho...

In [76]:
youtube.drop(["thumbnail_link","video_id","trending_date","publish_time","comments_disabled","ratings_disabled","video_error_or_removed"]
            ,axis=1,inplace=True)

In [77]:
youtube

,title,channel_title,category_id,tags,views,likes,dislikes,comment_count,description
0,WE WANT TO TALK ABOUT OUR MARRIAGE,CaseyNeistat,22,SHANtell martin,748374,57527,2966,15954,SHANTELL'S CHANNEL - https://www.youtube.com/s...
1,The Trump Presidency: Last Week Tonight with J...,LastWeekTonight,24,"last week tonight trump presidency|""last week ...",2418783,97185,6146,12703,"One year after the presidential election, John..."
2,"Racist Superman | Rudy Mancuso, King Bach & Le...",Rudy Mancuso,23,"racist superman|""rudy""|""mancuso""|""king""|""bach""...",3191434,146033,5339,8181,WATCH MY PREVIOUS VIDEO ▶ \n\nSUBSCRIBE ► http...
3,Nickelback Lyrics: Real or Fake?,Good Mythical Morning,24,"rhett and link|""gmm""|""good mythical morning""|""...",343168,10172,666,2146,Today we find out if Link is a Nickelback amat...
4,I Dare You: GOING BALD!?,nigahiga,24,"ryan|""higa""|""higatv""|""nigahiga""|""i dare you""|""...",2095731,132235,1989,17518,I know it's been a while since we did this sho...
...,...,...,...,...,...,...,...,...,...
23357,Why Bridges Move...,Practical Engineering,27,"thermal expansion|""expansion joint""|""thermal m...",456470,14826,279,820,...and other musings on thermal movement of la...
23358,Macaroni - A Recipe From 1784,Townsends,27,"townsends|""jas townsend and son""|""reenacting""|...",519220,13600,329,1350,Visit Our Website! ▶ http://www.townsends.us/ ...
23359,Chris Young - Hangin' On,ChrisYoungVEVO,10,"Losing sleep video|""losing sleep album""|""think...",1117570,7504,584,324,Chris Young's Hangin' On from his #1 album Los...
23360,Elderly man making sure his dog won't get wet,"Rock me, Joey Santiago.",15,"dog|""cute""|""adorable""|""doggo""|""doge""|""old""|""ma...",713574,12448,146,1474,very wholesome stuff.\n\nThis video was taken ...
23361,How to speak like Black Panther - BBC News,BBC News,1,"bbc|""bbc news""|""news""|""black panther""|""black p...",422979,7408,1344,1548,The new marvel film Black Panther is set in th...

In [78]:
len(youtube.index)

23362

In [79]:
len(youtube.columns)

9

In [80]:
a=youtube["likes"].mean()

In [81]:
b=youtube["dislikes"].mean()

In [82]:
(a+b)/2

23947.53458607996

In [84]:
(youtube["likes"].mean()+youtube["dislikes"].mean())/2

23947.53458607996

In [85]:
youtube["views"].max()

149376127

In [87]:
youtube[youtube["views"]==youtube["views"].max()]["title"].iloc[0]

'YouTube Rewind: The Shape of 2017 | #YouTubeRewind'

In [88]:
youtube[youtube["views"]==youtube["views"].min()]["title"].iloc[0]

'1 dead, others injured after Ky. school shooting'

In [91]:
youtube.groupby("category_id").mean()[["comment_count"]]

             comment_count
category_id
1              6003.651813
2              1730.438235
10            10383.559418
15             2474.376054
17             3256.199515
19             1833.011450
20             7578.383607
22             4491.865854
23             5432.868554
24             7178.388176
25             1523.749869
26             4992.165997
27             2143.574850
28             3350.945159
29           100071.562500
43             1340.375000

In [92]:
youtube["category_id"].value_counts()

24    5379
10    3366
26    2241
23    1978
25    1907
22    1886
28    1477
1     1324
17    1238
27    1002
15     593
2      340
20     305
19     262
29      48
43      16
Name: category_id, dtype: int64

In [95]:
youtube["title_len"]=youtube["title"].apply(len)

In [96]:
youtube

,title,channel_title,category_id,tags,views,likes,dislikes,comment_count,description,title_len
0,WE WANT TO TALK ABOUT OUR MARRIAGE,CaseyNeistat,22,SHANtell martin,748374,57527,2966,15954,SHANTELL'S CHANNEL - https://www.youtube.com/s...,34
1,The Trump Presidency: Last Week Tonight with J...,LastWeekTonight,24,"last week tonight trump presidency|""last week ...",2418783,97185,6146,12703,"One year after the presidential election, John...",62
2,"Racist Superman | Rudy Mancuso, King Bach & Le...",Rudy Mancuso,23,"racist superman|""rudy""|""mancuso""|""king""|""bach""...",3191434,146033,5339,8181,WATCH MY PREVIOUS VIDEO ▶ \n\nSUBSCRIBE ► http...,53
3,Nickelback Lyrics: Real or Fake?,Good Mythical Morning,24,"rhett and link|""gmm""|""good mythical morning""|""...",343168,10172,666,2146,Today we find out if Link is a Nickelback amat...,32
4,I Dare You: GOING BALD!?,nigahiga,24,"ryan|""higa""|""higatv""|""nigahiga""|""i dare you""|""...",2095731,132235,1989,17518,I know it's been a while since we did this sho...,24
...,...,...,...,...,...,...,...,...,...,...
23357,Why Bridges Move...,Practical Engineering,27,"thermal expansion|""expansion joint""|""thermal m...",456470,14826,279,820,...and other musings on thermal movement of la...,19
23358,Macaroni - A Recipe From 1784,Townsends,27,"townsends|""jas townsend and son""|""reenacting""|...",519220,13600,329,1350,Visit Our Website! ▶ http://www.townsends.us/ ...,29
23359,Chris Young - Hangin' On,ChrisYoungVEVO,10,"Losing sleep video|""losing sleep album""|""think...",1117570,7504,584,324,Chris Young's Hangin' On from his #1 album Los...,24
23360,Elderly man making sure his dog won't get wet,"Rock me, Joey Santiago.",15,"dog|""cute""|""adorable""|""doggo""|""doge""|""old""|""ma...",713574,12448,146,1474,very wholesome stuff.\n\nThis video was taken ...,45
23361,How to speak like Black Panther - BBC News,BBC News,1,"bbc|""bbc news""|""news""|""black panther""|""black p...",422979,7408,1344,1548,The new marvel film Black Panther is set in th...,42

In [97]:
def countTag(tag):
    taglist = tag.split("|")
    return len(taglist)

youtube["tags"].apply(countTag)

0         1
1         4
2        23
3        27
4        14
         ..
23357     4
23358    31
23359    25
23360    11
23361    13
Name: tags, Length: 23362, dtype: int64

In [98]:
youtube["tag_count"] = youtube["tags"].apply(countTag)

In [108]:
def likesdislikes(likes,dislikes):
    likeslist =[]
    for key,value in list(likes.iteritems()):
        likeslist.append(value)
    dislikeslist=[]
    for key,value in list(dislikes.iteritems()):
        dislikeslist.append(value)
        
    likedislike = list(zip(likeslist,dislikeslist))
    ratio =[]
    for like,dislike in likedislike:
        if(like+dislike)==0:
            ratio.append(0)
        else:
            ratio.append(like/(like+dislike))
    return ratio
youtube["likes_dislikes"]=likesdislikes(youtube["likes"],youtube["dislikes"])

In [109]:
youtube.sort_values("likes_dislikes",ascending=False,inplace =True)

In [110]:
youtube

,title,channel_title,category_id,tags,views,likes,dislikes,comment_count,description,title_len,tag_count,likes_dislikes
8694,Christmas Day 2000,vnbreyes,17,"Christmas|""Day""|""2000""|""Wallace""|""Lakers""|""Bla...",2987,2,0,0,Rasheed Wallace dropped 33 points and 13 rebou...,18,6,1.0
16100,Magic Highway USA,Joshua Levin,28,"Transportation|""Future""|""Highways""",5391,57,0,3,Snippet of Disney program Magic Highway U.S.A....,17,3,1.0
921,#StarOnFox Exclusive Clip for TheYBF.com,YBF Chic,24,[none],1975,4,0,0,Check out TheYBF.com Exclusive from STAR on Fo...,40,1,1.0
16369,First Responders Arrive To The Collapsed Floor...,9-1-1 on FOX,24,"9-1-1|""first responders""|""police""|""firefighter...",1426,14,0,0,First responders arrive to a collapsed floor d...,71,36,1.0
147,Improvising in the style of different classica...,Nahre Sol,10,"improvise classical music|""improvisation""|""cla...",5149,242,0,54,Here's a video just for fun - I decided to try...,77,18,1.0
...,...,...,...,...,...,...,...,...,...,...,...,...
15575,Official XFL Announcement with Vince McMahon,Alpha Entertainment,17,"Football|""MrMcMahon""|""Vince McMahon""|""XFL""",139068,0,0,0,The future of football kicks off in 2020. See ...,44,4,0.0
4752,The New Snapchat in 60 Seconds,Snapchat,10,"new snapchat|""version 2""|""snap inc""|""brandnew""...",3511909,0,0,0,"Evan Spiegel, co-founder and CEO, explains the...",30,11,0.0
16590,To Our Daughter,Kylie Jenner,22,"Kylie Jenner|""Kylie""|""Travis Scott""|""Baby""|""An...",40801423,0,0,0,Directed by Tyler Ross @wttyler\nMusic by Jaco...,15,5,0.0
15510,Carolyn's RV Life Spots A Fluffy Kitty In Blythe,Caravan Carolyn,22,Van living Nomad life campervan van dwelling n...,24540,0,0,770,"I'm a retired sheriff's deputy, living in my v...",48,1,0.0
22020,GET READY WITH ME | Halo Beauty Launch Day,Tati,26,"YouTube|""Beauty""|""Makeup""|""Tutorial""|""Review""|...",886203,0,0,0,"Unfortunately, I had to disable comments due t...",42,14,0.0